
#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИОтправитьУведомленияБоту() Экспорт
	
	// Получаем текст сообщений для отправки уведомлений
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.Текст,
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Отпрвляем сообщения в группу Телеграм
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.Текст;
		Если ОтправитьСообщениеВТелеграмЧат(ТекстСообщения) Тогда
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Отправить сообщение в телеграм чат.
// 
// Параметры:
//  ТекстСообщения - Строка - Текст сообщения
// 
// Возвращаемое значение:
//  Булево
Функция ОтправитьСообщениеВТелеграмЧат(ТекстСообщения)
	
	Токен = Константы.ВКМ_ТокенТелеграм.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
	Результат = Истина;
	
	АдресРесурса = "bot"+Токен+"/sendMessage?chat_id="+ИдентификаторГруппы+"&text="+ТекстСообщения;
	Соединение = Новый HTTPСоединение("api.telegram.org", , , , , 5, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Content-type","application/json");
	
	Ответ = Соединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка",УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		Результат  = Ложь;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка", УровеньЖурналаРегистрации.Информация,,, "Сообщение отправлено");
	Возврат Результат ;
	
КонецФункции

#КонецОбласти
