
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СформироватьАктыНаСервере(Период) Экспорт 
	
	Таблица = ПолучитьДанныеПоДоговорам(Период);
	
	МассивДанных = Новый Массив;
	
	Для Каждого Строка Из Таблица Цикл 
		
		Если НЕ ЗначениеЗаполнено(Строка.Реализация) Тогда 
			
			СозданныйДокумент = СоздатьДокументРеализации(Строка, КонецМесяца(Период));
			
			Если СозданныйДокумент <> Ложь Тогда
				МассивДанных.Добавить(Новый Структура("Договор, Реализация", Строка.Договор, СозданныйДокумент));
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		МассивДанных.Добавить(Новый Структура("Договор, Реализация", Строка.Договор, Строка.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Функция ПолучитьДанныеПоДоговорам(Период)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &КонецПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Резурьтат = Запрос.Выполнить().Выгрузить();
	
	Возврат Резурьтат;

КонецФункции

Функция СоздатьДокументРеализации(Строка, Дата)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Строка.Организация);
	ДанныеЗаполнения.Вставить("Контрагент", Строка.Владелец);
	ДанныеЗаполнения.Вставить("Договор", Строка.Договор);
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	НовыйДокумент.Комментарий = "Документ создан обработкой ""Массовое создание актов"".";
	НовыйДокумент.Дата = Дата;
	НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
	
	Если НовыйДокумент.ПроверитьЗаполнение() Тогда
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовыйДокумент.Ссылка;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
