
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//@skip-check unknown-form-parameter-access
	АдресДанныхДокумента = Параметры.АдресДанныхДокумента;
	ДанныеДокумента = ПолучитьИзВременногоХранилища(АдресДанныхДокумента);
	Год = ДанныеДокумента["Год"];
	ОтпускаСотрудников.Загрузить(ДанныеДокумента["ОтпускаСотрудников"]);
	
	// Вывод диаграммы Ганта
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОбластьЗаголовка.Текст = "График отпусков на " + Формат(Год, "ДФ=yyyy;") + " г.";
	ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Истина;
	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0);
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	
	Серия = ДиаграммаГанта.Серии.Добавить();
	
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		Точка = ДиаграммаГанта.Точки.Добавить();
		Точка.Текст = Отпуск.Сотрудник;
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		
		ГСЧ = Новый ГенераторСлучайныхЧисел(СтрДлина(Точка.Текст));
		Красный = ГСЧ.СлучайноеЧисло(50, 160);
		Зеленый = ГСЧ.СлучайноеЧисло(50, 200);
		Синий = ГСЧ.СлучайноеЧисло(120, 200);

		//@skip-check new-color
		Интервал.Цвет = Новый Цвет(Красный, Зеленый, Синий);
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = КонецДня(Отпуск.ДатаОкончания);
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти

