
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	Объект.НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	Если ЗначениеЗаполнено(Объект.НоменклатураАбонентскаяПлата) Тогда
		Константы.ВКМ_НоменклатураАбонентскаяПлата.Установить(Объект.НоменклатураАбонентскаяПлата);
	Иначе
		Сообщение = "Не заполнена номенклатура.";
		ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.НоменклатураАбонентскаяПлата");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НоменклатураРаботыСпециалиста) Тогда
		Константы.ВКМ_НоменклатураРаботыСпециалиста.Установить(Объект.НоменклатураРаботыСпециалиста);
	Иначе
		Сообщение = "Не заполнена номенклатура.";
		ОбщегоНазначения.СообщитьПользователю(Сообщение, , "Объект.НоменклатураРаботыСпециалиста");
		Возврат;
	КонецЕсли;
	
	Сообщение = "Константы успешно записаны.";
	ОбщегоНазначения.СообщитьПользователю(Сообщение);
КонецПроцедуры
#КонецОбласти

