#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ТокенТелеграм = Константы.ВКМ_ТокенТелеграм.Получить();
	Объект.ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сбросить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Внимание! Токен Telegram-бота и идентификатора группы будут сброшены.", 
					РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, 
					"Сброс токена бота и идентификатора группы.");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТокенТелеграм) Тогда
		Константы.ВКМ_ТокенТелеграм.Установить(Объект.ТокенТелеграм);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Токен телеграм бота записан";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = Объект.ТокенТелеграм;
		Сообщение.Текст = "Токен телеграм бота не заполнен";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторГруппы) Тогда
		Константы.ВКМ_ИдентификаторГруппыТелеграм.Установить(Объект.ИдентификаторГруппы);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Идентификатор группы телеграм записан.";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = Объект.ИдентификаторГруппы;
		Сообщение.Текст = "Идентификатор группы телеграм не заполнен.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьНаСервере()
	
	Константы.ВКМ_ТокенТелеграм.Установить("");
	Константы.ВКМ_ИдентификаторГруппыТелеграм.Установить("");
	
	Объект.ТокенТелеграм = Константы.ВКМ_ТокенТелеграм.Получить();
	Объект.ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Поле = Объект.ИдентификаторГруппы;
	Сообщение.Текст = "Токен Telegram-бота и идентификатора группы сброшен.";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		СброситьНаСервере();
	КонецЕсли;	
 
КонецПроцедуры

#КонецОбласти

